Revit 2024 API
TextNode.HorizontalAlignment Property
 Indicates default horizontal alignment of the text.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public HorizontalTextAlignment HorizontalAlignment { get; }
Visual Basic
Public ReadOnly Property HorizontalAlignment As HorizontalTextAlignment
	Get
Visual C++
public:
property HorizontalTextAlignment HorizontalAlignment {
	HorizontalTextAlignment get ();
}
See Also
TextNode Class
Autodesk.Revit.DB Namespace